{
  "portfolio": [
    {
      "title": "HikerNet",
      "description": "(In Progress) HikerNet is an Android app built to gather network measurements along hiking trails. The app utilizes Google's FusedLocationProvider API and Mapbox SDKs to facilitate data collection and display. The app sends the measured data to a web application to be stored and viewed/analyzed at a later time. This app is part of research project at Georgia Tech aimed at discovering new techniques for measuring network connectivity in rural areas in order to help increase access to the internet.",
      "tech": [
        "Android",
        "Java",
        "Realm",
        "Flask",
        "Python",
        "MongoDB"
      ],
      "platform": "web",
      "impact": "Potential Impact: explore network measurement practices and discover new techniques to better inform the process of increasing access to the internet in rural areas.",
      "app": "",
      "github": "",
      "youtube": "",
      "year": 2020,
      "images": [

      ]
    },
    {
      "title": "Yoogle",
      "description": "Yoogle is text caption search engine for YouTube videos. It let's you search any YouTube video with a transcript for a particular word and lists all the timestamps in the video where that word occurs. Future features include saving timestamp lists as collections and exporting hyperlinked PDF files.",
      "tech": [
        "Python",
        "Flask",
        "JavaScript",
        "Lottie",
        "YouTube API"
      ],
      "platform": "web",
      "impact": "Potential: increase studying efficiency for students, allow content within YouTube videos to be indexed and searched on the fly.",
      "app": "https://yoogle.app",
      "github": "",
      "youtube": "",
      "year": 2020,
      "images": [
        "yoogle-1.png",
        "yoogle-2.png"
      ]
    },
    {
      "title": "BirthdayMemories",
      "description": "BirthdayMemories is a simple React app that allows you to post videos and photos of your friends and loved ones for them to view on their birthday. After COVID 19, I couldn't get together with a lot of friends for their birthdays, so I decided to create this app to make their day as special as possible given the circumstances.",
      "tech": [
        "React.js",
        "HTML",
        "CSS",
        "JavaScript",
        "Lottie"
      ],
      "platform": "web",
      "impact": "N/A",
      "app": "",
      "github": "https://github.com/michaelkoohang/BirthdayMemories",
      "youtube": "",
      "year": 2020,
      "images": [
        "birthdaymemories-1.png",
        "birthdaymemories-2.png",
        "birthdaymemories-3.png",
        "birthdaymemories-4.png"
      ]
    },
    {
      "title": "WWDC19",
      "description": "This Xcode Playground was my submission to the WWDC scholarship program that Apple hosts each year for students to attend their conference. I noticed how Apple was really pushing their privacy marketing at the time, and it seemed to me that not enough people were really taking privacy seriously. This was especially important to me given the myriad of mechanisms that iPhones have in place to protect your data that you may never even notice while using it. So, I decided to create a simple puzzle game that involved solving 3 privacy-focused challenges, each related to a certain aspect of the iPhone that protect's people's privacy. The goal was to have a little fun while simultaneously giving a light introduction and/or reminder to how the iPhone protects users' privacy.",
      "tech": [
        "Swift",
        "Xcode",
        "Playgrounds",
        "Sketch"
      ],
      "platform": "desktop",
      "impact": "Awarded a scholarship to attend WWDC19 in San Jose, CA. I got to interact with a bunch of really cool engineers and developers and managed to meet some Apple executives such as Craig Federighi and Jony Ive.",
      "app": "",
      "github": "https://github.com/michaelkoohang/WWDC2019",
      "youtube": "",
      "year": 2019,
      "images": [
        "wwdc19-1.png",
        "wwdc19-2.png",
        "wwdc19-3.png",
        "wwdc19-4.png"
      ]
    }
  ]
}